       01 MTRINFO.
           05 MTRINFO-MTR-ID             PIC X(12).
           05 MTRINFO-USER-NAME          PIC X(50).
           05 MTRINFO-POWER-SUPL-NAME    PIC X(50).
           05 MTRINFO-POWER-PLAN-NAME    PIC X(50).

