           01 PRCPLANC.
              02 PRCPLANC-MTR-ID               PIC X(12).
              02 PRCPLANC-DARKPLAN-COST        PIC 9(5)V9(4).
              02 PRCPLANC-EVILPLAN-COST        PIC 9(5)V9(4).
              02 PRCPLANC-EVERYONE-COST        PIC 9(5)V9(4).

